Revit 2024 API
IExternalDBApplication.OnStartup Method
Implement this method to execute some tasks when Autodesk Revit starts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
ExternalDBApplicationResult OnStartup(
	ControlledApplication application
)
Visual Basic
Function OnStartup ( _
	application As ControlledApplication _
) As ExternalDBApplicationResult
Visual C++
ExternalDBApplicationResult OnStartup(
	ControlledApplication^ application
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.ControlledApplication
 Handle to the Revit Application object.
Return Value
Indicates if the external db application completes its work successfully.
Remarks
Typically, event handlers and updaters are registered in this method.
See Also
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace